#include <includes.hpp>
#include "tools/dump.hpp"
#include "tools/gsc.hpp"
#include "tools/pool.hpp"
#include "tools/fastfile.hpp"
#include "pool_weapon.hpp"
#include <utils/decrypt.hpp>
#include <games/bo4/pool.hpp>
#include <games/bo4/offsets.hpp>

using namespace tool::pool;
using namespace games::bo4;

// min hash value, otherwise might be a ptr
constexpr auto MIN_HASH_VAL = 0x1000000000000;

#pragma region data



static const char* itemGroupNames[] = {
    "weapon_smg",
    "weapon_assault",
    "weapon_tactical",
    "weapon_cqb",
    "weapon_lmg",
    "weapon_sniper",
    "weapon_pistol",
    "weapon_launcher",
    "weapon_knife",
    "weapon_special",
    "weapon_shotgun",
    "weapon_explosive",
    "weapon_grenade",
    "weapon_masterkey",
    "weapon_grenadelauncher",
    "weapon_flamethrower",
    "specialty",
    "talisman",
    "specialgrenade",
    "miscweapon",
    "feature",
    "bonuscard",
    "killstreak",
    "hero",
    "talent",
    "bubblegum",
    "bubblegum_consumable",
    "character",
};

static const char* attachmentsNames[] = {
    "none",
    "acog",
    "adsreload",
    "barrelchoke",
    "clantag",
    "custom1",
    "custom2",
    "custom3",
    "custom4",
    "custom5",
    "damage",
    "damage2",
    "dualoptic",
    "dw",
    "dynzoom",
    "elo",
    "extbarrel",
    "extbarrel2",
    "extclip",
    "extclip2",
    "extrapellets",
    "fastlockon",
    "fastreload",
    "fastreload2",
    "fmj",
    "fmj2",
    "gl",
    "grip",

        "ACTIVE_CAMO",
        "SENSORY_OVERLOAD",
        "ES_STRIKE",
        "IMMOLATION",
        "FIREFLY_SWARM",
        "SMOKESCREEN",
        "MISDIRECTION",
        "MRPUKEY",
        "SHOCK_FIELD",
        "RESURRECT",
        "HEAT_WAVE",
        "CLONE",
        "ROULETTE",
        "THIEF",
        "DISRUPTOR",
        "HORNET_SWARM",
        "GROUP_REVIVE",
        "XRAY_EYES",
        "EMERGENCY_MELEE",
        "SHOULDER_GUN",
        "GRAPPLE",
        "INVULNERABLE",
        "SPRINT_BOOST",
        "HEALTH_REGEN",
        "SELF_DESTRUCT",
        "BARRIER_BUILDER",
        "SPAWN_BEACON",
    };
    return t >= ARRAYSIZE(names) ? "invalid" : names[t];
}
const char* tool::pool::GuidedMissileTypeName(guidedMissileType_t t) {
    static const char* names[] = {
        "NONE",
        "SIDEWINDER",
        "HELLFIRE",
        "JAVELIN",
        "BALLISTIC",
        "WIREGUIDED",
        "TVGUIDED",
        "DRONE",
        "HEATSEEKING",
        "ROBOTECH",
        "DYNAMICIMPACTPOINT",
    };
    return t >= ARRAYSIZE(names) ? "invalid" : names[t];
}
const char* tool::pool::OffhandClassName(OffhandClass t) {
    static const char* names[] = {
        "NONE",
        "FRAG_GRENADE",
        "SMOKE_GRENADE",
        "FLASH_GRENADE",
        "GEAR",
        "SUPPLYDROP_MARKER",
        "GADGET",
    };
    return t >= ARRAYSIZE(names) ? "invalid" : names[t];
}
const char* tool::pool::OffhandSlotName(OffhandSlot t) {
    static const char* names[] = {
        "NONE",
        "LETHAL_GRENADE",
        "TACTICAL_GRENADE",
        "EQUIPMENT",
        "SPECIFIC_USE",
        "GADGET",
        "SPECIAL",
        "HERO_WEAPON",
        "TAUNT",
        "SCRIPTED",
    };
    return t >= ARRAYSIZE(names) ? "invalid" : names[t];
}
const char* tool::pool::LockOnTypeName(lockOnType_t t) {
    static const char* names[] = {
        "NONE",
        "LEGACY_SINGLE",
        "AP_SINGLE",
        "AP_MULTI",
    };
    return t >= ARRAYSIZE(names) ? "invalid" : names[t];
}
const char* tool::pool::WeapClassName(weapClass_t t) {
    static const char* names[] = {
        "RIFLE",
        "MG",
        "SMG",
        "SPREAD",
        "PISTOL",
        "GRENADE",
        "ROCKETLAUNCHER",
        "TURRET",
        "NON_PLAYER",
        "GAS",
        "ITEM",
        "MELEE",
        "KILLSTREAK_ALT_STORED_WEAPON",
        "PISTOL_SPREAD",
        "BALL",
    };
    return t >= ARRAYSIZE(names) ? "invalid" : names[t];
}
const char* tool::pool::ProjExplosionTypeName(projExplosionType_t t) {
    static const char* names[] = {
        "NONE",
        "GRENADE",
        "ROCKET",
        "FLASHBANG",
        "DUD",
        "SMOKE",
        "HEAVY_EXPLOSIVE",
        "FIRE",
        "NAPALM_BLOB",
        "BOLD",
        "SHRAPNEL_SPAN",
    };
    return t >= ARRAYSIZE(names) ? "invalid" : names[t];
}

#pragma endregion
enum PoolDumpOptionFlags {
    DDL_OFFSET = 1,
    DUMP_ASSETS = 2, // dump assets (not for the source repository because it's not an acceptable content)
};

class PoolOption {
public:
    bool m_help = false;
    bool m_any_type = false;
    bool m_dump_info = false;
    bool m_dump_all_available = false;
    const char* m_output = "pool";
    const char* m_dump_hashmap = NULL;
    std::vector<bool> m_dump_types{};
    uint64_t flags{};

    bool Compute(const char** args, INT startIndex, INT endIndex) {
        m_dump_types.clear();
        m_dump_types.reserve(pool::ASSET_TYPE_COUNT);
        for (size_t i = 0; i < pool::ASSET_TYPE_COUNT; i++) {
            m_dump_types.push_back(false);
        }
        // default values
        for (size_t i = startIndex; i < endIndex; i++) {
            const char* arg = args[i];

            if (!strcmp("-?", arg) || !_strcmpi("--help", arg) || !strcmp("-h", arg)) {
                m_help = true;
            }
            else if (!strcmp("-o", arg) || !_strcmpi("--output", arg)) {
                if (i + 1 == endIndex) {
                    LOG_ERROR("Missing value for param: {}!", arg);
                    return false;
                }
                m_output = args[++i];
            }
            else if (!_strcmpi("--info", arg) || !strcmp("-i", arg)) {
                m_dump_info = true;
            }
            else if (!_strcmpi("--all", arg) || !strcmp("-a", arg)) {
                m_dump_all_available = true;
            }
            else if (!strcmp("-f", arg) || !_strcmpi("--flag", arg)) {
                if (i + 1 == endIndex) {
                    LOG_ERROR("Missing value for param: {}!", arg);
                    return false;
                }
                const char* flagName = args[++i];

                if (!_strcmpi("ddloffset", arg)) {
                    flags |= DDL_OFFSET;
                }
                else if (!_strcmpi("assets", arg)) {
                    flags |= DUMP_ASSETS;
                }
                else {
                    LOG_ERROR("Invalid flag for {}: {}", arg, flagName);
                    return false;
                }
            }
            else if (!strcmp("-m", arg) || !_strcmpi("--hashmap", arg)) {
                if (i + 1 == endIndex) {
                    LOG_ERROR("Missing value for param: {}!", arg);
                    return false;
                }
                m_dump_hashmap = args[++i];
            }
            else if (*arg == '-') {
                LOG_ERROR("Invalid argument {}!", arg);
                return false;
            }
            else {
                pool::XAssetType assetType = pool::XAssetIdFromName(arg);

                if (assetType == pool::ASSET_TYPE_COUNT) {
                    if (*arg >= '0' && *arg <= '9') {
                        try {
                            assetType = (pool::XAssetType)std::strtol(arg, nullptr, 10);
                        }
                        catch (const std::invalid_argument& e) {
                            LOG_ERROR("Can't parse pool id '{}'", e.what());
                            assetType = pool::ASSET_TYPE_COUNT;
                        }
                    }
                    if (assetType < 0 || assetType >= pool::ASSET_TYPE_COUNT) {
                        LOG_ERROR("Invalid pool name: {}!", arg);
                        return false;
                    }
                }

                m_dump_types[assetType] = true;
                m_any_type = true;
            }
        }
        return true;
    }
    void PrintHelp() {
        LOG_INFO("-h --help       : Print help");
        LOG_INFO("-i --info       : Dump pool info");
        LOG_INFO("-a --all        : Dump all available pools");
        LOG_INFO("-o --output [d] : Output dir");
        LOG_INFO("-f --flag [f]   : Add flag");
    }
};


#pragma region structs



struct XAssetTypeInfo {
    uintptr_t name; // const char*
    uint64_t size;
    uint64_t globalvar_count;
    uintptr_t GetName; // const char* (__cdecl*)(const XAssetHeader*);
    uintptr_t SetName; // void(__cdecl* )(XAssetHeader*, uint64_t*);
};

struct XAssetPoolEntry {
    uintptr_t pool;
    uint32_t itemSize;
    int32_t itemCount;
    byte isSingleton;
    int32_t itemAllocCount;
    uintptr_t freeHead;
};
struct TranslationEntry {
    uintptr_t data;
    uintptr_t name;
    uint64_t pad0;
};
struct RawFileEntry {
    uintptr_t name; // 0x8
    uintptr_t pad0; // 0x10
    uintptr_t size; // 0x18
    uintptr_t buffer; // 0x20
};
struct RawString {
    uint64_t name; // 0x8
    uintptr_t padding; // 0x10 0
    uintptr_t stringvalue; // 0x18 const char*
};
struct LuaFile {
    uint64_t name;
    uint64_t pad08;
    uint32_t size;
    uintptr_t buffer;
};
struct BGPoolEntry {
    uint64_t name;
    uint64_t namepad;
    uintptr_t assetHeader;
};

struct BGCache {
    uint64_t name;
    uint64_t pad08;
    uintptr_t def;
    uint32_t count;
};

struct BGCacheInfoDef {
    pool::BGCacheTypes type;
    uint64_t name;
    uint64_t pad10;
    uint64_t string_count;
};

struct BGCacheInfo {
    uintptr_t name;
    pool::XAssetType assetType;
    uint32_t allocItems;
    uintptr_t registerFunc;
    uintptr_t unregisterFunc;
    uint64_t hash;
    uint64_t hashnull;
    byte demoOnly;
    byte unk31;
    byte unk32;
    byte unk33;
    uint32_t defaultEntryIndex;
    uint32_t startIndex;
    uint32_t unk3c;
    uint32_t checksum;
    byte unk44;
    byte unk45;
    byte unk46;
    byte unk47;
};

const char* EModeName(eModes mode, bool allocInvalid = false, const char* countVal = nullptr) {
    switch (mode) {
    case MODE_ZOMBIES: return "zombies";
    case MODE_MULTIPLAYER: return "multiplayer";
    case MODE_CAMPAIGN: return "campaign";
    case MODE_WARZONE: return "warzone";
    case MODE_COUNT:
        if (countVal) return countVal;
    default: {
        if (!allocInvalid) {
            return "<invalid>";
        }
        static char invalidBuffer[0x50];

        sprintf_s(invalidBuffer, "<invalid:%d>", (int)mode);
        return invalidBuffer;
    }
    }
}
const char* LobbyModeName(int mode, bool allocInvalid = false) {
    switch (mode) {
    case -1: return "campaign";
    case 0: return "multiplayer";
    case 1: return "zombies";
    case 2: return "warzone";
    default: {
        if (!allocInvalid) {
            return "<invalid>";
        }
        static char invalidBuffer[0x50];

        sprintf_s(invalidBuffer, "<invalid:%d>", (int)mode);
        return invalidBuffer;
    }
    }
}

struct GameTypeTableEntry {
    Hash name;
    Hash baseGameType;
    uint64_t unk20;
    Hash nameRef;
    Hash nameRefCaps;
    Hash descriptionRef;
    Hash unk58;
    bool isHardcoreAvailable;
    Hash hardcoreNameRef;
    bool isTeamBased;
    bool hideHudScore;
    uint64_t groupName;
    uintptr_t image; // GfxImage*
    Hash presenceString;
    uint64_t unkA8;
    uint64_t scoreInfoFile;
    uint64_t unkB8;
    uint64_t unkC0;
    uint64_t unkC8;
    uint64_t unkD0;
    uint64_t unkD8;
    uint64_t unkE0;
    uint64_t unkE8;
    uint64_t unkF0;
    int uniqueID;
    uint64_t unk100;
    uint64_t unk108;
};

struct GameTypeTable {
    uint64_t name;
    uint64_t namepad;
    uint32_t gameTypeCount;
    uintptr_t gameTypes; // GameTypeTableEntry*
    eModes sessionMode;
};
struct MapTable {//30
    uint64_t name;
    uint64_t namepad;
    uint32_t mapCount;
    uintptr_t maps; // MapTableEntry*
    eModes sessionMode;
    uint32_t campaignMode;
    uint32_t dlcIndex;
};
struct MapTableListElem
{
    uint64_t count;
    uintptr_t names; // Hash*
    uint64_t unk10;
    uint64_t unk18;
};

struct MapTableList
{
    Hash name;
    MapTableListElem list_campaign;
    MapTableListElem list_multiplayer;
    MapTableListElem list_zombies;
    MapTableListElem list_warzone;
};




struct GametypeEntry {
    uintptr_t v1; // 0x8
    uintptr_t pad0; // 0x10
    uintptr_t v3; // 0x18
    uintptr_t v4; // 0x20
    uintptr_t v5; // 0x28
};

enum StringTableCellType : INT {
    STC_TYPE_UNDEFINED = 0,
    STC_TYPE_STRING = 1,
    STC_TYPE_HASHED2 = 2,
    STC_TYPE_INT = 4,
    STC_TYPE_FLOAT = 5,
    STC_TYPE_BOOL = 6,
    STC_TYPE_HASHED7 = 7,
    STC_TYPE_HASHED8 = 8,
};


struct StringTableCell {
    byte value[20];
    StringTableCellType type;
};
// item size ... 40
struct StringTableEntry {
    uint64_t name; // 8
    int pad8; // 12
    int pad12; // 16
    int columnCount; // 20
    int rowCount; // 24
    int cellscount; // 28 empty?
    int unk24; // 32
    uintptr_t cells; // 40
    uintptr_t values; // 48 StringTableCell
    uintptr_t unk48; // 56
    uintptr_t unk56; // 64
};
#pragma endregion

inline bool HexValidString(const char* str) {
    if (!*str) {
        return false;
    }
    for (const char* s = str; *s; s++) {
        if (*s < ' ' || *s > '~') {
            return false;
        }
    }
    return true;
}

void tool::pool::WriteHex(std::ostream& out, uintptr_t base, byte* buff, size_t size, const Process& proc) {
    char strBuffer[101];
    for (size_t j = 0; j < size; j++) {
        if (j % 8 == 0) {
            if (base) {
                out << std::hex << std::setw(16) << std::setfill('0') << (base + j) << "~";
            }
            out << std::hex << std::setw(3) << std::setfill('0') << j << "|";
            if (j + 7 < size) {
                out << std::hex << std::setw(16) << std::setfill('0') << *reinterpret_cast<uint64_t*>(&buff[j]);
            }
        }
        if (j - j % 8 + 7 >= size) {
            out << std::hex << std::setw(2) << std::setfill('0') << (int)buff[j];
        }
