#include <includes.hpp>
#include "tools/dump.hpp"
#include "tools/gsc.hpp"
#include "tools/pool.hpp"
#include "tools/fastfile.hpp"

using namespace tool::pool;

// min hash value, otherwise might be a ptr
constexpr auto MIN_HASH_VAL = 0x1000000000000;

struct Hash {
    uint64_t name;
    uint64_t nullpad;
};

enum PoolDumpOptionFlags {
    DDL_OFFSET = 1
};

class PoolOption {
public:
    bool m_help = false;
    bool m_any_type = false;
    bool m_dump_info = false;
    bool m_dump_all_available = false;
    LPCCH m_output = "pool";
    LPCCH m_dump_hashmap = NULL;
    std::vector<bool> m_dump_types{};
    UINT64 flags{};

    bool Compute(LPCCH* args, INT startIndex, INT endIndex) {
        m_dump_types.clear();
        m_dump_types.reserve(pool::ASSET_TYPE_COUNT);
        for (size_t i = 0; i < pool::ASSET_TYPE_COUNT; i++) {
            m_dump_types.push_back(false);
        }
        // default values
        for (size_t i = startIndex; i < endIndex; i++) {
            LPCCH arg = args[i];

            if (!strcmp("-?", arg) || !_strcmpi("--help", arg) || !strcmp("-h", arg)) {
                m_help = true;
            }
            else if (!strcmp("-o", arg) || !_strcmpi("--output", arg)) {
                if (i + 1 == endIndex) {
                    std::cerr << "Missing value for param: " << arg << "!\n";
                    return false;
                }
                m_output = args[++i];
            }
            else if (!_strcmpi("--info", arg) || !strcmp("-i", arg)) {
                m_dump_info = true;
            }
            else if (!_strcmpi("--all", arg) || !strcmp("-a", arg)) {
                m_dump_all_available = true;
            }
            else if (!strcmp("-f", arg) || !_strcmpi("--flag", arg)) {
                if (i + 1 == endIndex) {
                    std::cerr << "Missing value for param: " << arg << "!\n";
                    return false;
                }
                auto flagName = args[++i];

                if (!_strcmpi("ddloffset", arg)) {
                    flags |= DDL_OFFSET;
                }
                else {
                    std::cerr << "Invalid flag for -" << arg << ": " << flagName << "\n";
                    return false;
                }
            }
            else if (!strcmp("-m", arg) || !_strcmpi("--hashmap", arg)) {
                if (i + 1 == endIndex) {
                    std::cerr << "Missing value for param: " << arg << "!\n";
                    return false;
                }
                m_dump_hashmap = args[++i];
            }
            else if (*arg == '-') {
                std::cerr << "Invalid argurment: " << arg << "!\n";
                return false;
            }
            else {
                auto assetType = pool::XAssetIdFromName(arg);

                if (assetType == pool::ASSET_TYPE_COUNT) {
                    try {
                        assetType = (pool::XAssetType)std::strtol(arg, nullptr, 10);
                    }
                    catch (const std::invalid_argument& e) {
                        std::cerr << e.what() << "\n";
                        assetType = pool::ASSET_TYPE_COUNT;
                    }
                    if (assetType < 0 || assetType >= pool::ASSET_TYPE_COUNT) {
                        std::cerr << "Invalid pool name: " << arg << "!\n";
                        return false;
                    }
                }

                m_dump_types[assetType] = true;
                m_any_type = true;
            }
        }
        return true;
    }
    void PrintHelp(std::ostream& out) {
        out << "-h --help            : Print help\n"
            << "-i --info            : Dump pool info\n"
            << "-a --all             : Dump all available pools\n"
            << "-o --output [d]      : Output dir\n"
            << "-f --flag [f]        : Add flag\n"
            ;
    }
};

struct XAssetTypeInfo {
    uintptr_t name; // const char*
    uint64_t size;
    uint64_t globalvar_count;
    uintptr_t GetName; // const char* (__cdecl*)(const XAssetHeader*);
    uintptr_t SetName; // void(__cdecl* )(XAssetHeader*, uint64_t*);
};

struct XAssetPoolEntry {
    uintptr_t pool;
    UINT32 itemSize;
    INT32 itemCount;
    BYTE isSingleton;
    INT32 itemAllocCount;
    uintptr_t freeHead;
};
struct TranslationEntry {
    uintptr_t data;
    uintptr_t name;
    UINT64 pad0;
};
struct RawFileEntry {
    uintptr_t name; // 0x8
    uintptr_t pad0; // 0x10
    uintptr_t size; // 0x18
    uintptr_t buffer; // 0x20
};
struct RawString {
    UINT64 name; // 0x8
    uintptr_t padding; // 0x10 0
    uintptr_t stringvalue; // 0x18 const char*
};
struct LuaFile {
    UINT64 name;
    UINT64 pad08;
    UINT32 size;
    uintptr_t buffer;
};
struct BGPoolEntry {
    UINT64 name;
    UINT64 namepad;
    uintptr_t assetHeader;
};

struct BGCache {
    UINT64 name;
    UINT64 pad08;
    uintptr_t def;
    UINT32 count;
};

struct BGCacheInfoDef {
    pool::BGCacheTypes type;
    uint64_t name;
    uint64_t pad10;
    uint64_t string_count;
};

struct BGCacheInfo {
    uintptr_t name;
    pool::XAssetType assetType;
    uint32_t allocItems;
    uintptr_t registerFunc;
    uintptr_t unregisterFunc;
    uint64_t hash;
    uint64_t hashnull;
    byte demoOnly;
    byte unk31;
    byte unk32;
    byte unk33;
    uint32_t defaultEntryIndex;
    uint32_t startIndex;
    uint32_t unk3c;
    uint32_t checksum;
    byte unk44;
    byte unk45;
    byte unk46;
    byte unk47;
};

enum eModes : INT32 {
    MODE_ZOMBIES = 0x0,
    MODE_MULTIPLAYER = 0x1,
    MODE_CAMPAIGN = 0x2,
    MODE_WARZONE = 0x3,
    MODE_COUNT = 0x4,
    MODE_INVALID = 0x4,
    MODE_FIRST = 0x0,
};

const char* EModeName(eModes mode, bool allocInvalid = false) {
    switch (mode) {
    case MODE_ZOMBIES: return "zombies";
    case MODE_MULTIPLAYER: return "multiplayer";
    case MODE_CAMPAIGN: return "campaign";
    case MODE_WARZONE: return "warzone";
    default: {
        if (!allocInvalid) {
            return "<invalid>";
        }
        static char invalidBuffer[0x50];

        sprintf_s(invalidBuffer, "<invalid:%d>", (int)mode);
        return invalidBuffer;
    }
    }
}
const char* LobbyModeName(int mode, bool allocInvalid = false) {
    switch (mode) {
    case -1: return "campaign";
    case 0: return "multiplayer";
    case 1: return "zombies";
    case 2: return "warzone";
    default: {
        if (!allocInvalid) {
            return "<invalid>";
        }
        static char invalidBuffer[0x50];

        sprintf_s(invalidBuffer, "<invalid:%d>", (int)mode);
        return invalidBuffer;
    }
    }
}

struct GameTypeTableEntry {
    Hash name;
    Hash baseGameType;
    uint64_t unk20;
    Hash nameRef;
    Hash nameRefCaps;
    Hash descriptionRef;
    Hash unk58;
    bool isHardcoreAvailable;
    Hash hardcoreNameRef;
    bool isTeamBased;
    bool hideHudScore;
    uint64_t groupName;
    uintptr_t image; // GfxImage*
    Hash presenceString;
    uint64_t unkA8;
    uint64_t scoreInfoFile;
    uint64_t unkB8;
    uint64_t unkC0;
    uint64_t unkC8;
    uint64_t unkD0;
    uint64_t unkD8;
    uint64_t unkE0;
    uint64_t unkE8;
    uint64_t unkF0;
    int uniqueID;
    uint64_t unk100;
    uint64_t unk108;
};

struct GameTypeTable {
    UINT64 name;
    UINT64 namepad;
    UINT32 gameTypeCount;
    uintptr_t gameTypes; // GameTypeTableEntry*
    eModes sessionMode;
};
struct MapTable {//30
    UINT64 name;
    UINT64 namepad;
    UINT32 mapCount;
    uintptr_t maps; // MapTableEntry*
    eModes sessionMode;
    UINT32 campaignMode;
    UINT32 dlcIndex;
};
struct MapTableListElem
{
    uint64_t count;
    uintptr_t names; // Hash*
    uint64_t unk10;
    uint64_t unk18;
};

struct MapTableList
{
    Hash name;
    MapTableListElem list_campaign;
    MapTableListElem list_multiplayer;
    MapTableListElem list_zombies;
    MapTableListElem list_warzone;
};




struct GametypeEntry {
    uintptr_t v1; // 0x8
    uintptr_t pad0; // 0x10
    uintptr_t v3; // 0x18
    uintptr_t v4; // 0x20
    uintptr_t v5; // 0x28
};

enum StringTableCellType : INT {
    STC_TYPE_UNDEFINED = 0,
    STC_TYPE_STRING = 1,
    STC_TYPE_HASHED2 = 2,
    STC_TYPE_INT = 4,
    STC_TYPE_FLOAT = 5,
    STC_TYPE_BOOL = 6,
    STC_TYPE_HASHED7 = 7,
    STC_TYPE_HASHED8 = 8,
};


struct StringTableCell {
    BYTE value[20];
    StringTableCellType type;
};
// item size ... 40
struct StringTableEntry {
    UINT64 name; // 8
    int pad8; // 12
    int pad12; // 16
    int columnCount; // 20
    int rowCount; // 24
    int cellscount; // 28 empty?
    int unk24; // 32
    uintptr_t cells; // 40
    uintptr_t values; // 48 StringTableCell
    uintptr_t unk48; // 56
    uintptr_t unk56; // 64
};

inline bool HexValidString(LPCCH str) {
    if (!*str) {
        return false;
    }
    for (LPCCH s = str; *s; s++) {
        if (*s < ' ' || *s > '~') {
            return false;
        }
    }
    return true;
}

void tool::pool::WriteHex(std::ostream& out, uintptr_t base, BYTE* buff, SIZE_T size, const Process& proc) {
    CHAR strBuffer[101];
    for (size_t j = 0; j < size; j++) {
        if (j % 8 == 0) {
            if (base) {
                out << std::hex << std::setw(16) << std::setfill('0') << (base + j) << "~";
            }
            out << std::hex << std::setw(3) << std::setfill('0') << j << "|";
            if (j + 7 < size) {
                out << std::hex << std::setw(16) << std::setfill('0') << *reinterpret_cast<UINT64*>(&buff[j]);
            }
        }
        if (j - j % 8 + 7 >= size) {
            out << std::hex << std::setw(2) << std::setfill('0') << (int)buff[j];
        }
        if ((j + 1) % 8 == 0) {
